var mockData = {
  id: 1,
  name: "云南省公安厅",
  nodes: [
    {
      id: 2,
      name: "昆明市公安局",
      nodes: [
        { name: "五华区公安分局" },
      ]
    },
    {
      id: 3,
      name: "丽江市公安局",
      nodes: [
        {
          id: 4,
          name: "古城区公安分局",
        },
        {
          id: 5,
          name: "永胜县公安局",
          nodes: [
            {
              id: 6,
              name: "永北镇派出所",
            },
            {
              id: 7,
              name: "三川镇派出所",
            },
          ]
        }
      ],
    },
  ],
};

//希望生成数组
/*
 每一行是一个数组

 //整体结构
 [
 []
 ,
 []
 ,
 []
 ]
 //具体包含
 id,父级坐标,自己坐标,文字
 {


 }
 */
